P = 5  # Основа числа
t = 16 # Кількість розрядів на число
r = 8  # Кількість розрядів у цілій частині числа

# Обчислимо максимальне значення для цілої частини числа (розряди r)
max_integer_part = P**r - 1

# Обчислимо максимальне значення для дробової частини числа (розряди t - r)
max_fractional_part = P**(t - r) - 1

# Обчислимо мінімальне значення для дробової частини числа (розряди t - r)
min_fractional_part = 0

# Виведемо діапазон чисел
puts "Діапазон чисел: #{max_integer_part}.#{min_fractional_part} - #{max_integer_part}.#{max_fractional_part}"
